
// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.


let arr = ['a', 'b', 'c' ];
let arr1 = ['1', '2', '3'];


// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3. (через push и через splice)

let massiv = ['a', 'b', 'c'];
massiv.push('1', '2', '3');
console.log(massiv)


// 6) Вывести числа от 4 до 400 на экран.

// let i = 3;
// let result = '';
// while (i<400) {
//     i++;
//     result += i;
// }
// console.log(result)

// ___________________________________________________


// 7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.

// for (let i=4; i<14; i +=3){
//     console.log(i);
// }

// ___________________________________________________


// 8) Вывести числа 654 653 652 до нуля.

// for (let i=654; i<655; i--) {
//     if (i <= -1) {
//         break;
//     }
//     console.log(i)
// }

// _____________________________________________________


// 9) Вывести все годы с 1983 до 2017.

// for (let i = 1983; i<2018; i++) {
//     console.log('год: '+i);
// }

// ______________________________________________________


// 10) Вывести числа -4 -2 0 2 4 6 ...100.

// for (let i=-4; i<101; i+=2) {
//     console.log(i);
// }

// ______________________________________________________

